constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    ( 0 -2.44 0 )
    ( 6 -2.44 0 )
    ( 0  1 0 )
    ( 6  1 0 )
                 
    ( 0 -2.44 0.1 )
    ( 6 -2.44 0.1 )
    ( 0  1 0.1 )
    ( 6  1 0.1 )                    
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) (80 80 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall inlet
    (
        (0 4 6 2)
    )

    wall bottom 
    (
        (0 1 5 4)
    )

    wall outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (2 3 7 6)
    )
    
    empty frontBack
    (
        (0 1 3 2)
        (4 5 7 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
