0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    flapper
    {
        type            fixedFluxPressure;
    }

    inlet
    {
        type            fixedFluxPressure;
    }

    bottom
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            fixedFluxPressure;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    frontBack
    {
        type            empty;
    }

}

// ************************************************************************* //
