0/pointMotionUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    flapper
    {
        type            timeVaryingUniformFixedValue;
        outOfBounds     10;
    }

    outlet
    {
        type            slip;
    }

    inlet
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    atmosphere
    {
        type            slip;
    }

    frontBack
    {
        type            empty;
    }

}

// ************************************************************************* //
